{
  "plugins": {
    "blackhole": {
      "src": "https://github.com/biisal/blackhole"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "custom-nvim-themes": {
      "src": "https://github.com/MrWaffle243/custom-nvim-themes"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon",
      "version": "'harpoon2'"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "undotree": {
      "src": "https://github.com/mbbill/undotree"
    }
  }
}
